
#Область ОбработчикиСобытий	

&НаСервере
Функция ПолучитьСтавкуНДФЛ(Ставка) Экспорт 
	СтавкаНДФЛЧисло = 0;  
	Если Ставка = Перечисления.НДФЛСтавки.Ставка13  Тогда 
		СтавкаНДФЛЧисло = 13;
	КонецЕсли;
	Если Ставка = Перечисления.НДФЛСтавки.Ставка15 Тогда 
		СтавкаНДФЛЧисло = 15;
	КонецЕсли;
	Если Ставка = Перечисления.НДФЛСтавки.Ставка18 Тогда
		СтавкаНДФЛЧисло = 18;
	КонецЕсли;
	Если Ставка = Перечисления.НДФЛСтавки.Ставка20 Тогда
		СтавкаНДФЛЧисло = 20;
	КонецЕсли;
	Если Ставка = Перечисления.НДФЛСтавки.Ставка22 Тогда
		СтавкаНДФЛЧисло = 22;
	КонецЕсли;
	Возврат СтавкаНДФЛЧисло;
	
КонецФункции			
		
#КонецОбласти		
		
		
		
	