#Область ОбработчикСобытий
	
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр СвободныеУровни Расход
	Движения.СвободныеУровни.Записывать = Истина; 
	Для Каждого ТекСтрокаАкции Из Акции Цикл 
		Если ТекСтрокаАкции.Уровень.Пустая() = Ложь Тогда;
			ИспользоватьСтратегию = ТекСтрокаАкции.Акция.УчетПоСтратегии;
			Если ИспользоватьСтратегию = Истина Тогда
				Движение 					= Движения.СвободныеУровни.Добавить();
				Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
				Движение.Период 			= Дата;
				Движение.Уровень 			= ТекСтрокаАкции.Уровень;
				ОткланениеКоличествоПокупки = ТекСтрокаАкции.Уровень.КоличествоПокупки - ТекСтрокаАкции.Уровень.КоличествоПродажи;
				Движение.КоличествоПокупки 	= ТекСтрокаАкции.КоличествоАкций;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	// регистр УчетАкций Приход 
	Движения.УчетАкций.Записывать = Истина;
	
	Для Каждого ТекСтрокаАкции Из Акции Цикл
		Движение 				= Движения.УчетАкций.Добавить();
		Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.БрокерскийСчет = БрокерскийСчёт;
		Движение.Акция 			= ТекСтрокаАкции.Акция;
		Движение.Уровень 		= ТекСтрокаАкции.Уровень;
		Движение.Количество 	= ТекСтрокаАкции.КоличествоАкций;
		Движение.Сумма 			= ТекСтрокаАкции.Сумма;
		Движение.СуммаРасходов 	= ТекСтрокаАкции.Комиссия;
	КонецЦикла; 
	
	//Регистр Уровни
	
	Движения.Уровни.Записывать = Истина;
	Для Каждого ТекСтрокаАкции Из Акции Цикл
		Если ТекСтрокаАкции.Уровень.Пустая() = Ложь Тогда
			Движение 					= Движения.Уровни.Добавить();
			Движение.Период 			= Дата;
			Движение.БрокерскийСчет 	= БрокерскийСчёт;
			Движение.Акция 				= ТекСтрокаАкции.Акция;
			Движение.Уровень 			= ТекСтрокаАкции.Уровень;
			Движение.АктивностьУровня 	= Истина;
			Движение.ЦенаПокупки 		= ТекСтрокаАкции.Уровень.ЦенаПокупки; 
			Движение.КоличествоПокупки 	= 0;
			Движение.ЦенаПродажи 		= ТекСтрокаАкции.Уровень.ЦенаПродажи;
			Движение.КоличествоПродажи 	= ТекСтрокаАкции.Уровень.КоличествоПродажи ;
		КонецЕсли;
	КонецЦикла
КонецПроцедуры
	

#КонецОбласти 

#Область ОбработчикСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.ИтогоСуммаДокумента = ЭтотОбъект.Акции.Итог("Сумма") + ЭтотОбъект.Акции.Итог("Комиссия");
		
КонецПроцедуры


#КонецОбласти