
#Область ОбработчикиСобытийЭлементовФормы
            &НаКлиенте
Процедура ДивидентыДивидентПриИзменении(Элемент)
	СтрокаРасчета 					= Элементы.Дивиденты.ТекущиеДанные;
	СтрокаРасчета.СуммаДивидентов 	= СтрокаРасчета.Дивидент * СтрокаРасчета.КоличествоАкций;
	Ставка							= СтрокаРасчета.СтавкаНДФЛ;

	СтавкаНДФЛЧисло                 = ПолучитьСтавкуНДФЛСервер(Ставка);
	СтрокаРасчета.СуммаНДФЛ         = Окр(СтрокаРасчета.СуммаДивидентов * СтавкаНДФЛЧисло/100,0,2 );
	СтрокаРасчета.ЧистаяСумма 		= СтрокаРасчета.СуммаДивидентов - СтрокаРасчета.СуммаНДФЛ;
	КонецПроцедуры

&НаКлиенте
Процедура ДивидентыКоличествоАкцийПриИзменении(Элемент)
	СтрокаРасчета 					= Элементы.Дивиденты.ТекущиеДанные;
	СтрокаРасчета.СуммаДивидентов 	= СтрокаРасчета.Дивидент * СтрокаРасчета.КоличествоАкций;
	Ставка							= СтрокаРасчета.СтавкаНДФЛ;
	СтавкаНДФЛЧисло                 = ПолучитьСтавкуНДФЛСервер(Ставка);
	СтрокаРасчета.СуммаНДФЛ         = Окр(СтрокаРасчета.СуммаДивидентов * СтавкаНДФЛЧисло/100,0,2 );
	СтрокаРасчета.ЧистаяСумма 		= СтрокаРасчета.СуммаДивидентов - СтрокаРасчета.СуммаНДФЛ;
КонецПроцедуры

&НаКлиенте
Процедура ДивидентыСуммаДивидентовПриИзменении(Элемент)
	СтрокаРасчета 					= Элементы.Дивиденты.ТекущиеДанные;
	СтрокаРасчета.Дивидент 			= СтрокаРасчета.СуммаДивидентов/СтрокаРасчета.КоличествоАкций;
	Ставка							= СтрокаРасчета.СтавкаНДФЛ;
	СтавкаНДФЛЧисло                 = ПолучитьСтавкуНДФЛСервер(Ставка);
	СтрокаРасчета.СуммаНДФЛ         = Окр(СтрокаРасчета.СуммаДивидентов * СтавкаНДФЛЧисло/100,0,2 );
	СтрокаРасчета.ЧистаяСумма 		= СтрокаРасчета.СуммаДивидентов - СтрокаРасчета.СуммаНДФЛ;

КонецПроцедуры

&НаКлиенте
Процедура ДивидентыСтавкаНДФЛПриИзменении(Элемент)
	СтрокаРасчета 					= Элементы.Дивиденты.ТекущиеДанные;
	Ставка							= СтрокаРасчета.СтавкаНДФЛ;
	СтавкаНДФЛЧисло                 = ПолучитьСтавкуНДФЛСервер(Ставка);
	СтрокаРасчета.СуммаНДФЛ         = Окр(СтрокаРасчета.СуммаДивидентов * СтавкаНДФЛЧисло/100,0,2 );
	СтрокаРасчета.ЧистаяСумма 		= СтрокаРасчета.СуммаДивидентов - СтрокаРасчета.СуммаНДФЛ;
КонецПроцедуры 



 &НаСервере
 Функция ПолучитьСтавкуНДФЛСервер(Ставка) Экспорт
	 
	 СтавкаНДФЛЧисло 				= СлужебныйПолучитьСтавкуНДФЛ.ПолучитьСтавкуНДФЛ(Ставка);
	 
	 Возврат  СтавкаНДФЛЧисло;
 КонецФункции //ПолучитьСтавкуНДФЛС ()

&НаКлиенте
 Процедура ДивидентыСуммаНДФЛПриИзменении(Элемент)
	 СтрокаРасчета 					= Элементы.Дивиденты.ТекущиеДанные;
	 СтрокаРасчета.ЧистаяСумма 		= СтрокаРасчета.СуммаДивидентов - СтрокаРасчета.СуммаНДФЛ;
 КонецПроцедуры
 

 


#КонецОбласти