
 &НаСервере
 Функция ПолучитьОбъектПоСсылкеНаСервере(СсылкаНаОбъект) Экспорт 
	 
	 ОбъектСсылки = СсылкаНаОбъект.ПолучитьОбъект();
     Возврат ОбъектСсылки;
 	
 
 КонецФункции // ()
 
 &НаСервере
 Функция РезультатЗапросаВСтруктуру(Знач РезультатЗапроса) Экспорт
	
	Результат = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
КонецФункции