
//Функция проверяет настройки программы  учёта по стратегии. 
Функция ПроверитьНастрокуУчетаПоСтратегии(СписокАкций, Дата) Экспорт
	
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Акция",СписокАкций);
	Запрос.Текст ="ВЫБРАТЬ
	              |	УчетПоСтратегииАкцийСрезПоследних.БрокерскийСчет КАК БрокерскийСчет,
	              |	УчетПоСтратегииАкцийСрезПоследних.Акция КАК Акция,
	              |	УчетПоСтратегииАкцийСрезПоследних.Период КАК ДатаНачалаУчетаПоСтратегии,
	              |	УчетПоСтратегииАкцийСрезПоследних.ВестиУчет КАК ВестиУчет
	              |ИЗ
	              |	РегистрСведений.УчетПоСтратегииАкций.СрезПоследних(
	              |			&Дата,
	              |			Акция В (&Акция)
	              |				И ВестиУчет = ИСТИНА) КАК УчетПоСтратегииАкцийСрезПоследних";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ТаблицаАкции = РезультатЗапроса.Выгрузить();
	МассивАкцийСУчетомПоСтратегии = ОбщегоНазначенияКлиентСервер.ПреобразоватьТаблицуЗначенийВМассив(ТаблицаАкции);
	Возврат МассивАкцийСУчетомПоСтратегии;
	
КонецФункции // ()
