
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//Не использовать типовой конструктор!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаАкций") Тогда
		МестоХраненияДенежныхСредств = ДанныеЗаполнения.БрокерскийСчёт.МестоХраненияДенежныхСредств;
		СтатьяДвиженияДенежныхСредств = ДанныеЗаполнения.БрокерскийСчёт.СДДСПриПродаже;
		Сумма = ДанныеЗаполнения.ИтогоСуммаДокумента;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДивидентыПолученные") Тогда
		МестоХраненияДенежныхСредств = ДанныеЗаполнения.БрокерскийСчет.МестоХраненияДенежныхСредств;
		Сумма = ДанныеЗаполнения.ЧистаяДенежнаяСумма;
	КонецЕсли;
	КонецПроцедуры

	Процедура ОбработкаПроведения(Отказ, Режим)
		//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

		// регистр ДенежныеСредства 
		Движения.ДенежныеСредства.Записывать = Истина;
		Движение = Движения.ДенежныеСредства.Добавить();
		Движение.Период = Дата;
		Движение.МестоХранения = МестоХраненияДенежныхСредств;
		Движение.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
		Движение.Сумма = Сумма;

		//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	КонецПроцедуры
  //Не использовать типовой конструктор!!!
	