
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПолучитьТикер(ПараметрКоманды);
КонецПроцедуры

&НаСервере
Процедура ПолучитьТикер(ПараметрКоманды)
	АкцияКурс = ПараметрКоманды.ПолучитьОбъект(); 
	ТикерКурс = АкцияКурс.Тикер;
	СекцияРынка = "shares";
	НачалоПериода = '2024-11-25';
	КонецПериода =  '2024-11-26'; 
	СсылкаАкция = ПараметрКоманды;
	//ПолучитьИсториюЦен.ЗагрузитьКотировкиМинута(ТикерКурс, НачалоПериода, КонецПериода, СекцияРынка, СсылкаАкция)
    ПолучитьИсториюЦен.СформироватьСписокАкций();
КонецПроцедуры 

