
#Область ОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура КоличествоЛотовПриИзменении(Элемент)
	
	Количество 		= Объект.КоличествоЛотов * ПолучитьКоличествоАкцийВЛоте(Объект.Инструмент, Объект.Дата);
	Объект.Сумма 	=  Количество * Объект.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	Количество 		= Объект.КоличествоЛотов * ПолучитьКоличествоАкцийВЛоте(Объект.Инструмент, Объект.Дата);
	Объект.Сумма 	=  Количество * Объект.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	КоличествоАкцийВЛоте 	= ПолучитьКоличествоАкцийВЛоте(Объект.Инструмент, Объект.Дата);
	Объект.КоличествоЛотов 	=  Цел(Объект.Сумма / Объект.Цена /КоличествоАкцийВЛоте);
	Объект.Сумма 			=  Объект.КоличествоЛотов * КоличествоАкцийВЛоте * Объект.Цена;
	
КонецПроцедуры

//&НаКлиенте
// Процедура ДатаСоздание(Элемент, СтандартнаяОбработка)
//	 СтандартнаяОбработка = Ложь;
//	 Объект.Дата = ТекущаяДата() - ПолучитьОткланениеОтВремениБиржи();
//	 
// КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции  

&НаСервереБезКонтекста
  Функция ПолучитьКоличествоАкцийВЛоте(Акция, ПериодОтбора)
	
	Возврат  РегистрыСведений.Лоты.ПолучитьАктуальноеКоличествоАкцийВЛоте(Акция, ПериодОтбора);
     
 КонецФункции // ПолучитьКоличествоАкцийВЛоте()

&НаСервереБезКонтекста
Функция  ПолучитьОткланениеОтВремениБиржи()

    ОткланениеОтВремениБиржи = Константы.ОткланениеОтВремениБиржи * 60;
	
КонецФункции



#КонецОбласти