
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Уровни
	Движения.Уровни.Записывать = Истина;
	Для Каждого ТекСтрокаРаспределение Из Распределение Цикл
		Движение = Движения.Уровни.Добавить();
		Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Акция = Акция;
		Движение.Уровень = ТекСтрокаРаспределение.Уровень;
		Движение.АктивностьУровня = Истина;
		Движение.ЦенаПокупки = ТекСтрокаРаспределение.УровеньЦенаПокупки; 
		Если ТекСтрокаРаспределение.КоличествоПокупки > 0 Тогда
			Движение.КоличествоПокупки = 0;
		Иначе 
			Движение.КоличествоПокупки = ТекСтрокаРаспределение.УровеньКоличествоПокупки;
		КонецЕсли;
		Движение.ЦенаПродажи = ТекСтрокаРаспределение.УровеньЦенаПродажи;
		Движение.КоличествоПродажи = ТекСтрокаРаспределение.КоличествоПродажи;
	КонецЦикла;

	 КонецПроцедуры
