#Область ОбработчикиСобытийЭлементовФорм
&НаКлиенте
Процедура АкцииКоличествоЛотовПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Акции.ТекущиеДанные;
	КоличесвтоАкцийВЛоте = ПолучитьКоличествоАкцийВЛоте(СтрокаРасчета.Акция, Объект.Дата);
	СтрокаРасчета.КоличествоАкций = СтрокаРасчета.КоличествоЛотов * КоличесвтоАкцийВЛоте; 
	СтрокаРасчета = Элементы.Акции.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.КоличествоАкций;
	СтрокаРасчета.Комиссия = Окр(СтрокаРасчета.Сумма * ПолучитьКомиссиюБрокера()/100,2,1);

КонецПроцедуры

&НаКлиенте
Процедура АкцииЦенаПриИзменении(Элемент)
	
	СтрокаРасчета = Элементы.Акции.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.КоличествоАкций;
	СтрокаРасчета.Комиссия = Окр(СтрокаРасчета.Сумма * ПолучитьКомиссиюБрокера()/100,2,1);
	
КонецПроцедуры

&НаКлиенте
Процедура АкцииКоличествоАкцийПриИзменении(Элемент)

	СтрокаРасчета = Элементы.Акции.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.КоличествоАкций;
	СтрокаРасчета.Комиссия = Окр(СтрокаРасчета.Сумма * ПолучитьКомиссиюБрокера()/100,2,1);
	

КонецПроцедуры

&НаСервере
Процедура УстановкаДатыДокумента()

	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;

КонецПроцедуры

//&НаКлиенте
// Процедура АкцииАкцияПриИзменении(Элемент)
//	 
//	 НоваяСтрока =ЭтотОбъект.ЭтаФорма.   Акция.Добавить();
//	 НоваяСтрока.Акция = Элемент.Значение;
//	 ЗаполнитьЗначенияСвойств(ЭтотОбъект.Акция.ТекущиеДанные, НоваяСтрока);
//	 ЭтотОбъект.Акции.Удалить(НоваяСтрока); 
//	 
//	 
// КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьКоличествоАкцийВЛоте(Акция, ПериодОтбора)
	
	Возврат  РегистрыСведений.Лоты.ПолучитьАктуальноеКоличествоАкцийВЛоте(Акция, ПериодОтбора);
     
 КонецФункции // ПолучитьКоличествоАкцийВЛоте()

 &НаСервереБезКонтекста
 Функция ПолучитьКомиссиюБрокера()
	     КомиссияБрокера = Константы.КомиссияБрокера.Получить();
	 Возврат КомиссияБрокера;
	 КонецФункции;

 
#КонецОбласти 