
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетАкций Приход
	Движения.УчетАкций.Записывать = Истина;
	Для Каждого ТекСтрокаДивиденты Из Дивиденты Цикл
		Движение = Движения.УчетАкций.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.БрокерскийСчет = БрокерскийСчет;
		Движение.Акция = ТекСтрокаДивиденты.Акция;
		Движение.СуммаДоходов = ТекСтрокаДивиденты.ЧистаяСумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.ИтоговаяСумма = ЭтотОбъект.Дивиденты.Итог("ЧистаяСумма");
	
	
КонецПроцедуры
