
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДенежныеСредства Расход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХраненияДенежныхСредств;
	Движение.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// Внесено изменение. Не использовать типовой конструктор !!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПокупкаАкций") Тогда
		// Заполнение шапки
		МестоХраненияДенежныхСредств 	= ДанныеЗаполнения.БрокерскийСчёт.МестоХраненияДенежныхСредств; 
		Сумма							= ДанныеЗаполнения.ИтогоСуммаДокумента
	КонецЕсли;
	
КонецПроцедуры
