//Проверка количество акций доступных к покупке или продаже по Уровню
Функция ЕстьПерепродажаУровня(Уровень, Дата)

	        	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвободныеУровниОстаткиИОбороты.Уровень КАК Уровень,
		|	СвободныеУровниОстаткиИОбороты.КоличествоПокупкиКонечныйОстаток КАК КоличествоПокупкиКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.СвободныеУровни.ОстаткиИОбороты(, , Авто, , ) КАК СвободныеУровниОстаткиИОбороты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецФункции   //ЕстьПерепродажаУровня
// ВЫБРАТЬ
//	ПокупкаАкций.Акции.(
//		КоличествоАкций КАК КоличествоАкций,
//		Уровень КАК Уровень
//	) КАК Акции
//ИЗ
//	Документ.ПокупкаАкций КАК ПокупкаАкций
//ГДЕ
//	ПокупкаАкций.Ссылка = &СсылкаУ