
&НаКлиенте
Процедура ЗаполнитьТаблицуРаспределение(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.БрокерскийСчет) Тогда
		Сообщить( НСтр("ru= 'Необходимо заполнить поле ""Брокерский счет""'"));
		Возврат;
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.Акция) Тогда
			Сообщить( НСтр("ru= 'Необходимо заполнить поле ""Акция""'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Объект.Распределение.Очистить();
	МассивСтрок = ВыбратьДействующиеУровниИзРегистра(); 
	Для каждого Строки Из МассивСтрок Цикл 
		СтрокаРаспределения = Объект.Распределение.Добавить(); 
		СтрокаРаспределения.Уровень = Строки.Уровень;
		СтрокаРаспределения.УровеньЦенаПокупки = Строки.УровеньЦенаПокупки;
		СтрокаРаспределения.УровеньКоличествоПокупки = Строки.УровеньКоличествоПокупки;
		СтрокаРаспределения.УровеньЦенаПродажи = Строки.УровеньЦенаПродажи;
		СтрокаРаспределения.УровеньКоличествоПродажи = Строки.УровеньКоличествоПродажи; 
	КонецЦикла;
	

	
КонецПроцедуры

&НаСервере
Функция ВыбратьДействующиеУровниИзРегистра()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Уровни.БрокерскийСчет КАК БрокерскийСчет,
	               |	Уровни.Акция КАК Акция,
	               |	Уровни.Уровень КАК Уровень,
	               |	Уровни.АктивностьУровня КАК АктивностьУровня,
	               |	Уровни.Уровень.ЦенаПокупки КАК УровеньЦенаПокупки,
	               |	Уровни.Уровень.КоличествоПокупки КАК УровеньКоличествоПокупки,
	               |	Уровни.Уровень.ЦенаПродажи КАК УровеньЦенаПродажи,
	               |	Уровни.Уровень.КоличествоПродажи КАК УровеньКоличествоПродажи
	               |ИЗ
	               |	РегистрСведений.Уровни КАК Уровни
	               |ГДЕ
	               |	Уровни.БрокерскийСчет = &БрокерскийСчет
	               |	И Уровни.Акция = &Акция
	               |	И Уровни.АктивностьУровня = &АктивностьУровня
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Уровни.Уровень.ЦенаПокупки УБЫВ";
	Запрос.Параметры.Вставить("БрокерскийСчет", Объект.БрокерскийСчет);
	Запрос.Параметры.Вставить("Акция",Объект.Акция);
	Запрос.Параметры.Вставить("АктивностьУровня", Ложь);
	Выборка = Запрос.Выполнить();
	РезультатЗапроса = Выборка.Выбрать();
	МассивСтрок = Новый Массив;
	Пока РезультатЗапроса.Следующий() Цикл   
		ОписаниеУровня = Новый Структура();
		ОписаниеУровня.Вставить("Уровень", РезультатЗапроса.Уровень); 
		ОписаниеУровня.Вставить("УровеньЦенаПокупки", РезультатЗапроса.УровеньЦенаПокупки);
		ОписаниеУровня.Вставить("УровеньКоличествоПокупки", РезультатЗапроса.УровеньКоличествоПокупки);
		ОписаниеУровня.Вставить("УровеньЦенаПродажи", РезультатЗапроса.УровеньЦенаПродажи);
		ОписаниеУровня.Вставить("УровеньКоличествоПродажи", РезультатЗапроса.УровеньКоличествоПродажи);	
		МассивСтрок.Добавить(ОписаниеУровня);
	КонецЦикла;
	Возврат  МассивСтрок;
КонецФункции 

&НаКлиенте
Процедура РаспределитьКоличествоПоУровням(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.КоличествоКРаспределению) Тогда
			Сообщить( НСтр("ru= 'Укажите ""Количество к распределению""'"));
			Возврат;
		КонецЕсли;
	КоличествоКРаспределению = Объект.КоличествоКРаспределению;
	Если КоличествоКРаспределению > 0 Тогда
		Для каждого ТекущаяСтрока Из Объект.Распределение Цикл
			КоличествоПокупкиПоУровню = ТекущаяСтрока.УровеньКоличествоПокупки;
			Если КоличествоКРаспределению >= КоличествоПокупкиПоУровню  Тогда
				ТекущаяСтрока.КоличествоПокупки = КоличествоПокупкиПоУровню;
				ТекущаяСтрока.КоличествоПродажи = ТекущаяСтрока.УровеньКоличествоПродажи;
				КоличествоКРаспределению = КоличествоКРаспределению - КоличествоПокупкиПоУровню;
			Иначе 
				ТекущаяСтрока.КоличествоПокупки = КоличествоКРаспределению;
				ТекущаяСтрока.КоличествоПродажи = КоличествоКРаспределению;
				КоличествоКРаспределению = КоличествоКРаспределению - КоличествоКРаспределению;
				
			КонецЕсли;
		КонецЦикла;	
		
	Иначе
		Сообщить( НСтр("ru='Укажите количество акций к распределению'"));
		Возврат;
	КонецЕсли;		
КонецПроцедуры
