 #Область СлужебныеПроцедурыИФункции
 
 Процедура ОбработкаПроведения(Отказ, Режим)
	 // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	 
	 // регистр УчетАкций Расход
	 Движения.УчетАкций.Записывать = Истина;
	 Для Каждого ТекСтрокаАкции Из Акции Цикл
	 	ТЗ = Новый ТаблицаЗначений;
		ТЗ = Акции.Выгрузить(,"Акция,Уровень,КоличествоАкций,Сумма,Комиссия");
		ТЗ.Свернуть("Акция,Уровень","КоличествоАкций,Сумма,Комиссия");
	КонецЦикла;

	 Для Каждого ТекСтрокаАкции Из ТЗ Цикл
		 Движение 				= Движения.УчетАкций.Добавить();
		 Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		 Движение.Период 		= Дата;
		 Движение.БрокерскийСчет = БрокерскийСчёт;
		 Движение.Акция 		= ТекСтрокаАкции.Акция;
		 Движение.Уровень 		= ТекСтрокаАкции.Уровень; 
		 Результат = ОстаткиУпрУчета(БрокерскийСчёт.Ссылка, ТекСтрокаАкции.Акция, ТекСтрокаАкции.Уровень, Дата);
		 КоличествоИзРегистра 	= Результат.Количество;
		 СуммаИзРегистра 		= Результат.Сумма;  
		 // Проверка отрицательных остатков по количеству 
		 Если КоличествоИзРегистра > ТекСтрокаАкции.КоличествоАкций Тогда
			 Движение.Количество 	= ТекСтрокаАкции.КоличествоАкций;
			 СуммаСписания 			= СуммаИзРегистра / КоличествоИзРегистра * ТекСтрокаАкции.КоличествоАкций;
			 Движение.Сумма 		= СуммаСписания;
			 КоличествоОтклПоРегистру 	= КоличествоИзРегистра - ТекСтрокаАкции.КоличествоАкций;
			 КоличествоОтклПоУровню		= ТекСтрокаАкции.Уровень.КоличествоПокупки - ТекСтрокаАкции.Уровень.КоличествоПродажи;
			 СуммаОстаткаПоРегистур 	= СуммаИзРегистра - СуммаСписания;
			 Если КоличествоОтклПоРегистру > КоличествоОтклПоУровню Тогда
				 Движение 				= Движения.УчетАкций.Добавить();
				 Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
				 Движение.Период 		= Дата;
				 Движение.БрокерскийСчет = БрокерскийСчёт;
				 Движение.Акция 		= ТекСтрокаАкции.Акция;
				 Движение.Уровень 		= ТекСтрокаАкции.Уровень;
				 Движение.Количество 	= КоличествоОтклПоУровню;
				 СуммаСписания 			= СуммаИзРегистра / КоличествоИзРегистра * КоличествоОтклПоУровню;
				 Движение.Сумма 		= СуммаСписания;
				 //Приход накопленных акций
				 Движение 				= Движения.УчетАкций.Добавить();
				 Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
				 Движение.Период 		= Дата;
				 Движение.БрокерскийСчет = БрокерскийСчёт;
				 Движение.Акция 		= ТекСтрокаАкции.Акция;
				 Движение.Количество 	= КоличествоОтклПоУровню;
				 СуммаСписания 			= СуммаИзРегистра / КоличествоИзРегистра * КоличествоОтклПоУровню;
				 Движение.Сумма 		= СуммаСписания; 
			 КонецЕсли;
			 Если КоличествоОтклПоРегистру = КоличествоОтклПоУровню Тогда
				 Движение 				= Движения.УчетАкций.Добавить();
				 Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
				 Движение.Период 		= Дата;
				 Движение.БрокерскийСчет = БрокерскийСчёт;
				 Движение.Акция 		= ТекСтрокаАкции.Акция;
				 Движение.Уровень 		= ТекСтрокаАкции.Уровень;
				 Движение.Количество 	= КоличествоОтклПоУровню;
				 Движение.Сумма 		= СуммаОстаткаПоРегистур;
				 //Приход накопленных акций
				 Движение 				= Движения.УчетАкций.Добавить();
				 Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
				 Движение.Период 		= Дата;
				 Движение.БрокерскийСчет = БрокерскийСчёт;
				 Движение.Акция 		= ТекСтрокаАкции.Акция;
				 Движение.Количество 	= КоличествоОтклПоУровню;
				 Движение.Сумма 		= СуммаОстаткаПоРегистур;
			 КонецЕсли;
		 КонецЕсли;
		 Если КоличествоИзРегистра 	= ТекСтрокаАкции.КоличествоАкций Тогда
			 Движение.Количество 	= ТекСтрокаАкции.КоличествоАкций;
			 СуммаСписания 			= СуммаИзРегистра;
			 Движение.Сумма 		= СуммаСписания; 
		 КонецЕсли;
		 Если КоличествоИзРегистра 	< ТекСтрокаАкции.КоличествоАкций Тогда
			 КоличествоНедостачи = КоличествоИзРегистра - ТекСтрокаАкции.КоличествоАкций;
			 СуммаСписания 			= СуммаИзРегистра;
			 Текст 				= СтрШаблон("На брокерском счете ""%1"" по уровню ""%2"" нехватает %3 шт. акций ""%4"". ", БрокерскийСчёт, ТекСтрокаАкции.Уровень, КоличествоНедостачи, ТекСтрокаАкции.Акция);
			 Сообщить(НСтр("ru= '" + Текст + "'" ));
			 Отказ = Истина; 	
		 КонецЕсли;
		 Движение 				 = Движения.УчетАкций.Добавить();
		 Движение.ВидДвижения 	 = ВидДвиженияНакопления.Приход;
		 Движение.Период 		 = Дата;
		 Движение.БрокерскийСчет = БрокерскийСчёт;
		 Движение.Акция 		 = ТекСтрокаАкции.Акция;
		 Движение.Уровень 		 = ТекСтрокаАкции.Уровень;
		 Если ТекСтрокаАкции.Сумма > СуммаСписания Тогда
			 Движение.СуммаДоходов = ТекСтрокаАкции.Сумма - СуммаСписания;		
		 КонецЕсли;
		 Если ТекСтрокаАкции.Сумма < СуммаСписания Тогда
			 Движение.СуммаРасходов = СуммаСписания - ТекСтрокаАкции.Сумма;		
		 КонецЕсли;
		 Движение.СуммаРасходов	= ТекСтрокаАкции.Комиссия;
	 КонецЦикла;
	 
	 Движения.СвободныеУровни.Записывать = Истина;
	 Для Каждого ТекСтрокаАкции Из Акции Цикл
		 ИспользоватьСтратегию = ТекСтрокаАкции.Акция.УчетПоСтратегии;
		 Если ИспользоватьСтратегию = Истина Тогда
			 Движение 					= Движения.СвободныеУровни.Добавить();
			 Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
			 Движение.Период				= Дата;
			 Движение.Уровень 			= ТекСтрокаАкции.Уровень;
			 КоличествоПродажи = ТекСтрокаАкции.Уровень.КоличествоПродажи;
			 КоличествоПокупки = ТекСтрокаАкции.Уровень.КоличествоПокупки;
			 КоличествоДокумент = ТекСтрокаАкции.КоличествоАкций;
			 Если КоличествоДокумент < КоличествоПродажи Тогда
				 Движение.КоличествоПокупки 	= ТекСтрокаАкции.КоличествоАкций;
			 КонецЕсли;
			 Если КоличествоДокумент >= КоличествоПродажи И КоличествоДокумент <= КоличествоПокупки Тогда
				 Движение.КоличествоПокупки 	= КоличествоПокупки;		
			 КонецЕсли;
			 Если КоличествоДокумент > КоличествоПокупки Тогда
				 Сообщить(НСтр("ru= 'По уровню" + ТекСтрокаАкции.Уровень + "  не достаточно акций'"));
			 КонецЕсли;
		 КонецЕсли;
	 КонецЦикла; 
	 
	 //Регистр Уровни
	 Движения.Уровни.Записывать = Истина;
	 Счетчик = 0;
	 Для Каждого ТекСтрокаАкции Из ТЗ Цикл
		 Счетчик = 1 + Счетчик;
		 Если Счетчик = 1 Тогда
			 Движение 				= Движения.Уровни.Добавить();
			 Движение.Период = Дата;
			 Движение.БрокерскийСчет = БрокерскийСчёт;
			 Движение.Акция = ТекСтрокаАкции.Акция;
			 Движение.Уровень = ТекСтрокаАкции.Уровень;
			 Движение.АктивностьУровня = Истина;
			 Движение.ЦенаПокупки = ТекСтрокаАкции.Уровень.ЦенаПокупки; 
			 Движение.КоличествоПокупки = ТекСтрокаАкции.Уровень.КоличествоПокупки;
			 Движение.ЦенаПродажи = ТекСтрокаАкции.Уровень.ЦенаПродажи;
			 Движение.КоличествоПродажи = 0;
		 КонецЕсли
	 КонецЦикла
	 
	 
 КонецПроцедуры
 
 Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	 //Ввод на основании документа "Покупка акций"
	 Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПокупкаАкций") Тогда
		 // Заполнение шапки
		 БрокерскийСчёт = ДанныеЗаполнения.БрокерскийСчёт;
		 Для Каждого ТекСтрокаАкции Из ДанныеЗаполнения.Акции Цикл
			 НоваяСтрока = Акции.Добавить();
			 НоваяСтрока.Акция = ТекСтрокаАкции.Акция;
			 //НоваяСтрока.КоличествоАкций = ТекСтрокаАкции.КоличествоАкций; 
			 НоваяСтрока.КоличествоАкций = ТекСтрокаАкции.Уровень.КоличествоПродажи;
			 //НоваяСтрока.КоличествоЛотов = ТекСтрокаАкции.КоличествоЛотов;
			 //
			 КоличествоАкцийВЛоте 		= ПолучитьКоличествоАкцийВЛоте(ТекСтрокаАкции.Акция, ЭтотОбъект.Дата);
			 КоличествоЛотов				= Цел(ТекСтрокаАкции.Уровень.КоличествоПродажи / КоличествоАкцийВЛоте) ;
			 Если КоличествоЛотов > 0 Тогда
				 КоличествоЛотов = КоличествоЛотов;
			 Иначе 
				 КоличествоЛотов = 1;			
			 КонецЕсли;
			 НоваяСтрока.КоличествоЛотов = КоличествоЛотов;
			 НоваяСтрока.Сумма 			= ТекСтрокаАкции.Сумма;
			 НоваяСтрока.Цена 			= ТекСтрокаАкции.Цена;
			 НоваяСтрока.Уровень 			= ТекСтрокаАкции.Уровень;
		 КонецЦикла;
	 КонецЕсли;
 КонецПроцедуры
 
 &НаСервере
 Функция ПолучитьКоличествоАкцийВЛоте(Акция, ПериодОтбора)
	 
	 Возврат  РегистрыСведений.Лоты.ПолучитьАктуальноеКоличествоАкцийВЛоте(Акция, ПериодОтбора);
	 
 КонецФункции // ПолучитьКоличествоАкцийВЛоте()
 
 &НаСервере
 Функция ОстаткиУпрУчета (БрокерскийСчет,Акция,Уровень,Дата)
	 
	 Результат = Новый Структура;
	 Запрос = Новый Запрос( "ВЫБРАТЬ
	 |	УчетАкцийОстатки.КоличествоОстаток КАК КоличествоОстаток,
	 |	УчетАкцийОстатки.СуммаОстаток КАК СуммаОстаток
	 |ИЗ
	 |	РегистрНакопления.УчетАкций.Остатки(&Дата, ) КАК УчетАкцийОстатки
	 |ГДЕ
	 |	УчетАкцийОстатки.Уровень = &Уровень
	 |	И УчетАкцийОстатки.Акция = &Акция
	 |	И УчетАкцийОстатки.БрокерскийСчет = &БрокерскийСчет");
	 Запрос.УстановитьПараметр("Уровень", Уровень);
	 Запрос.УстановитьПараметр("Акция", Акция);
	 Запрос.УстановитьПараметр("БрокерскийСчет", БрокерскийСчет);
	 Запрос.УстановитьПараметр("Дата", Дата);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 Результат.Вставить("Количество", ВыборкаДетальныеЗаписи.КоличествоОстаток);
		 Результат.Вставить("Сумма", ВыборкаДетальныеЗаписи.СуммаОстаток); 
	 КонецЦикла;
	 
	 
	 Возврат Результат;  
	 
	 
 КонецФункции // ()
   
 #КонецОбласти   


#Область ОбработчикСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.ИтогоСуммаДокумента = ЭтотОбъект.Акции.Итог("Сумма") + ЭтотОбъект.Акции.Итог("Комиссия"); 
	ЭтотОбъект.ЧистаяДенежнаяСумма = ЭтотОбъект.Акции.Итог("Сумма") - ЭтотОбъект.Акции.Итог("Комиссия");
		
КонецПроцедуры

#КонецОбласти