&НаСервере
Процедура ПередЗаписью (Отказ) 
	Запрос = Новый Запрос ; 
	Запрос.Текст = "ВЫБРАТЬ
					|	Акции.Ссылка КАК Ссылка,
					|	Акции.Тикер КАК Тикер
					|ИЗ
					|	Справочник.Акции КАК Акции
					|ГДЕ
					|	Акции.Тикер = &Тикер И
					|   Акции.Ссылка <> &Ссылка;";
	Запрос.УстановитьПараметр("Тикер",ЭтотОбъект.Тикер);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Ложь;
	Иначе
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элемент справичника с таким тикером уже существует!"; 
		Сообщение.Сообщить();
		
		
	КонецЕсли;	
	
КонецПроцедуры
