
Процедура ОбработкаПроведения(Отказ, Режим)

	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СвободныеУровни Приход
	Движения.СвободныеУровни.Записывать = Истина;
	Движение = Движения.СвободныеУровни.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Уровень = Ссылка;
	Движение.КоличествоПокупки = КоличествоПокупки;
	
	
	Движения.Уровни.Записывать = Истина;
	Движение = Движения.Уровни.Добавить();
	Движение.Период = Дата;
	Движение.БрокерскийСчет = БрокерскийСчет;
	Движение.Акция = Акция;
	Движение.Уровень = Ссылка;
	Движение.АктивностьУровня = Ложь;
	Движение.ЦенаПокупки = ЦенаПокупки;
	Движение.КоличествоПокупки = КоличествоПокупки;
	Движение.ЦенаПродажи = ЦенаПродажи;
	Движение.КоличествоПродажи = КоличествоПродажи;
	
	
   КонецПроцедуры
